# Cask directory for applications
cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
# or (maybe):
# tap "caskroom/cask", args: ["--full"]
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"

cask "caskroom/versions/java8"
#brew "scala"
#brew "sbt"
brew "maven"
brew "gradle"
brew "gdub"
brew "groovysdk"
#brew "node"
cask "intellij-idea"
#cask "intellij-idea-ce"
#cask "sourcetree" # how did sourcetree become so buggy? :'(
cask "gitkraken"
cask "kdiff3"
#cask "dash"
cask "dbeaver-community"
cask "docker"
cask "kitematic"
cask "postman"

#cask "kafka-tool"
brew "awscli"
brew "amazon-ecs-cli"
cask "tunnelblick"

#brew "carthage"
#brew "watchman"
#cask "android-file-transfer"
#cask "android-studio"
#cask "drawio"
#cask "nordic-nrf5x-command-line-tools"
#cask "segger-jlink"

#cask "slack"
#cask "toggl"
cask "rocket-chat"

brew "jq"

mas "Xcode", id: 497799835

