# Cask directory for applications
cask_args appdir: "/Applications"

tap "hashicorp/tap"

brew "asdf"
brew "ansible"
cask "anydesk"
cask "citrix-workspace"
brew "cloud-sql-proxy"
#cask "dash"
brew "dive"
#cask "dbeaver-community"
cask "docker"
#cask "drawio"
cask "firefox"
#brew "git-flow"
cask "google-cloud-sdk"
brew "gnu-sed"
brew "graphviz"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/terraform"
cask "intellij-idea"
#brew "iperf"
#brew "iperf3"
brew "jq"
brew "kubectl"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-teams"
#brew "minikube"
cask "mongodb-compass"
cask "mountain-duck"
brew "mosquitto"
cask "mqttx"
brew "nmap"
brew "openfortivpn"
cask "openlens"
brew "openssl"
brew "pinentry-mac"
cask "postman"
cask "remote-desktop-manager"
#cask "royal-tsx"
cask "sublime-merge"
#brew "watchman"
brew "websocat"
cask "wireshark"
