# Cask directory for applications
cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
# or (maybe):
# tap "homebrew/cask", args: ["--full"]
#tap "homebrew/cask-fonts" # not used below
#tap "homebrew/cask-versions" # not used below
tap "homebrew/bundle"
tap "homebrew/core"

# SDKs (the ones not with sdkman.io)
#brew "node"
#cask "android-studio"

# Source control
cask "sublime-merge"
#cask "sourcetree" # how did sourcetree become so buggy? :'(
#cask "gitkraken"

# IDEs & tools
cask "intellij-idea"
#cask "intellij-idea-ce"
#cask "kdiff3"
#cask "dash"
cask "docker"
#brew "minikube"
brew "kubectl"
#cask "lens"
brew "dive"
#cask "dbeaver-community"
brew "graphviz"
cask "postman"
#cask "drawio"
#brew "watchman"
cask "google-cloud-sdk"
brew "jq"
brew "git-flow"
cask "firefox"
cask "mongodb-compass"
brew "websocat"

# ops tools
brew "ansible"
brew "iperf"
brew "iperf3"
brew "nmap"
cask "royal-tsx"
cask "citrix-workspace"

# Other tools
cask "mountain-duck"
brew "openssl"
brew "gnu-sed"
brew "openfortivpn"
brew "pinentry-mac"
#cask "forticlient-vpn" # note post-install step!
cask "zoom"
cask "microsoft-teams"



#mas "Xcode", id: 497799835
