# Cask directory for applications
cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"

# Dependencies
brew "mas"

# Security
cask "knockknock"
#cask "blockblock"
#cask "lulu"

# Shells
brew "zsh"
brew "bash"

# CLI
brew "coreutils"
brew "findutils"
brew "git"
brew "hstr"
brew "htop"
brew "mtr"
brew "par2"
brew "pstree"
brew "rclone"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"

# Fonts
#cask "font-hack-nerd-font"
#cask "font-source-code-pro"

# GUI applications
cask "1password"
#cask "bartender"
#cask "dropbox" # disable until M1 support is available, use maestral instead
cask "forklift"
cask "google-chrome"
cask "gpg-suite"
cask "hyperkey"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "jordanbaird-ice"
cask "keka"
cask "keyboardcleantool"
cask "logi-options-plus"
cask "macpar-deluxe"
#cask "maestral" # replaces dropbox, until dropbox finally adds M1 support
cask "mountain-duck"
cask "obsidian"
cask "raycast"
#cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "sublime-merge"

# MAS applications
#mas "Adze Lite", id: 499527341
#mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
#mas "Flycut", id: 442160987
#mas "Hidden Bar", id: 1452453066
mas "reMarkable", id: 1276493162
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
#mas "Notability", id: 360593530
#mas "Trello", id: 1278508951
