# Cask directory for applications
cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
# or (maybe):
# tap "caskroom/cask", args: ["--full"]
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"

# Dependencies
brew "mas"

# Shells
brew "zsh"
brew "bash"

# CLI
brew "coreutils"
brew "findutils"
brew "git"
brew "htop"
brew "jq"
brew "mackup"
brew "mtr"
brew "par2"
brew "rclone"
brew "telnet"
brew "tmux"
brew "trash"
brew "tree"
brew "watch"
brew "wget"

# Fonts
cask "caskroom/fonts/font-hack-nerd-font"
cask "caskroom/fonts/font-source-code-pro"

# GUI applications
cask "1password"
cask "apptivate"
cask "atom"
cask "authy"
cask "bartender"
cask "caffeine"
cask "dropbox"
cask "forklift"
cask "franz"
cask "google-chrome"
cask "gpg-suite"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "jadengeller-helium"
cask "journey"
cask "microsoft-office"
cask "rclone-browser"
cask "sizeup"
cask "skype"
cask "spotify"
cask "the-unarchiver"
cask "toggl"
cask "tripmode"

# disabled
# cask "adobe-photoshop-lightroom"
# cask "firefox"
# cask "flash-player"
# cask "macvim"
# cask "sequel-pro"
# cask "skitch"
# cask "silverlight"
# cask "skype"
#cask virtualbox # loads kernel module, TODO figure out how to do this nicely automatically

# Development (split out?)
cask "caskroom/versions/java8"
brew "scala"
brew "maven"
cask "gradle"
cask "gdub"
cask "intellij-idea-ce"
#cask "sourcetree" # how did sourcetree become so buggy? :'(
cask "gitkraken"
cask "dash"
cask "dbeaver-community"
cask "docker"
cask "kitematic"
cask "postman"

# MAS applications
mas "Airmail 3", id: 918858936
mas "DaisyDisk", id: 411643860
mas "Flycut", id: 442160987
mas "Wunderlist", id: 410628904
